//特殊的质数肋骨
#include<bits/stdc++.h>

using namespace std;

//超时

// //判断质数
// bool prime(int n) {
// 	int stop = n/6+1, Tstop=sqrt(n)+5;
// 	if(n==2 || n==3 || n==5 || n==7 || n==11) {
// 		return 1;
// 	}
// 	if(n%2==0 || n%3==0 || n%5==0 || n==1) {
// 		return 0;
// 	}
// 	for(int i = 1; i<=stop; i++) {
// 		if(i*6>=Tstop){break;}
// 		if((n%(i*6+1)==0) || (n%(i*6+5)==0)) {
// 			return 0;
// 		}
// 	}
// 	return 1;
// }

// //判断特殊质数肋骨
// bool judge(int n){
//     while(n){
//         if(prime(n)){
//             n /= 10;
//         }else{
//             return 0;
//         }
//     }
//     return 1;
// }


// int main()
// {
//     int n = 0;
//     cin>>n;//位数
//     int low = pow(10, n-1);//下限
//     int up = pow(10, n)-1;//上限
//     for(int i = low; i<=up; i++){
//         if(judge(i)){
//             cout<<i<<endl;
//         }
//     }

// }

//打表
int main()
{
    int n = 0;
    cin>>n;//位数
    int low = pow(10, n-1);//下限
    int up = pow(10, n)-1;//上限
    int table[84] = {0,2,3,5,7,23,29,31,37,53,59,71,73,79,233,239,293,311,313,317,373,379,593,599,719,733,739,797,2333,2339,2393,2399,2939,3119,3137,3733,3739,3793,3797,5939,7193,7331,7333,7393,23333,23339,23399,23993,29399,31193,31379,37337,37339,37397,59393,59399,71933,73331,73939,233993,239933,293999,373379,373393,593933,593993,719333,739391,739393,739397,739399,2339933,2399333,2939999,3733799,5939333,7393913,7393931,7393933,23399339,29399999,37337999,59393339,73939133};
    for(int i = 1; i<=83; i++){
        if(table[i]<=up && table[i]>=low){
            cout<<table[i]<<endl;
        }
    }
    return 0;
}



